In [1]:
# Student Data Challenge
 
#Import the dependencies

import pandas as pd
import os

In [2]:
# Deliverable 1: Collect the Data
# Create the path and import the data

full_student_data = os.path.join('Resources', 'new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)

In [3]:
# Verify that the data was properly imported
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [4]:
# Deliverable 2: Prepare the Data

# Check for null values
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [5]:
# # Drop rows with null values and verify removal
student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [6]:
# Check for duplicated rows
student_df.duplicated().sum()

1836

In [7]:
# # Drop duplicated rows and verify removal
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [8]:
# Check data types
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [9]:
# Examine the grade column to understand why it is not an int
student_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [10]:
# Remove the non-numeric characters and verify the contents of the column
student_df['grade'] = student_df['grade'].str.replace('th', '')

In [11]:
# View the grade column to ensure "th" were removed
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [12]:
# Change the grade column to the int type and verify column types
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [13]:
# Deliverable3: Summarize the Data

# Display summary statistics for the DataFrame
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [14]:
# Display the mean math score using the mean function
mean_math_score = student_df['math_score'].mean()
mean_math_score

64.67573326141189

In [15]:
# Store the minimum reading score as min_reading_score
min_reading_score = student_df['reading_score'].min()
min_reading_score

10.5

In [17]:
# Step 4: Drill down into the data

# Use loc to display the grade column
student_df.loc[:, ["grade"]]

       grade
0          9
1          9
2          9
3          9
5          9
...      ...
19508     10
19509     12
19511     11
19512     11
19513     12

[14831 rows x 1 columns]

In [20]:
# Use `iloc` to display the first 3 rows and columns 3, 4, and 5.
student_df.iloc[0:3, 3:6]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [29]:
# Select the rows for grade nine and display their summary statistics using `loc` and `describe`.
grade_nine_df = student_df.loc[student_df["grade"] == 9]
grade_nine_df.describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [22]:
# Store the row with the minimum overall reading score as `min_reading_row`
# using `loc` and the `min_reading_score` found in Deliverable 3.
min_reading_score = student_df["reading_score"].min()
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [39]:
# Use conditional selection to return student data for those students scorling less than 70 in math

# Use loc with conditionals to select all reading scores from 10th graders at Dixon High School.
student_df.loc[(student_df["school_name"] == "Dixon High School") &
(student_df["grade"] == 10), "reading_score"]

45       71.1
60       59.5
69       88.6
94       81.5
100      95.3
         ...
19283    52.9
19306    58.0
19344    38.0
19368    84.4
19445    43.9
Name: reading_score, Length: 569, dtype: float64

In [40]:
# Find the mean reading score for all students in grades 11 and 12 combined.
student_df.loc[(student_df["grade"] == 11) | (student_df["grade"] == 12), "reading_score"].mean()

74.90038089192188

In [42]:
# Deliverable 5: Make Comparisons between Ditrict and Charter Schools

# Use groupby and mean to find the average budget for each school type.
avg_budget_by_schooltype = student_df.groupby(by='school_type').mean()
avg_budget_by_schooltype.loc[:, ["school_budget"]]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [47]:
# Use the `groupby`, `count`, and `sort_values` functions to find the
# total number of students at each school and sort from most students to least students.
student_count = student_df.groupby(by='school_name').count()
student_count.loc[:, ["student_id"]].sort_values("student_id", ascending=False)

                        student_id
school_name
Montgomery High School        2038
Green High School             1961
Dixon High School             1583
Wagner High School            1541
Silva High School             1109
Woods High School             1052
Sullivan High School           971
Turner High School             846
Bowers High School             803
Fisher High School             798
Richard High School            551
Campos High School             541
Odonnell High School           459
Campbell High School           407
Chang High School              171

In [53]:
# Aggregate the data by school name and then by grade. Then calculate the average math score
avgmath_by_schooltype = student_df.groupby(['school_type', 'grade']).mean()
avgmath_by_schooltype.loc[:, ["math_score"]]

                   math_score
school_type grade
Charter     9       70.077874
            10      66.443206
            11      68.024735
            12      60.212121
Public      9       63.771066
            10      63.764121
            11      59.314337
            12      63.568319

In [54]:
# BONUS: Not sure which set of instructions to follow 
# Using the grouby and mean functions,find the average budget per grade for each school type
avgbudget_by_schooltype = student_df.groupby(['school_type', 'grade']).mean()
avgbudget_by_schooltype.loc[:, ["school_budget"]]

                   school_budget
school_type grade
Charter     9      863817.290130
            10     871823.608811
            11     874262.713649
            12     885096.335017
Public      9      926800.159528
            10     914715.360382
            11     900248.905136
            12     895952.915971

In [ ]:
Markdown

Summary

At a quick glance, this data shows some results that could be expected:

   Reading scores overall are higher than math scores, assuming from the minimums and maximums that the scoring is 
   from 1 to 100.

   Charter schools have higher math scores than Public schools.

There are a few interesting results that are worth noting:

   Public schools have higher budgets than do Charter Schools, both average budgets overall and budgets for each  
   grade. All budgets are between $817,615 and $991,918. It is unknown if this range is significant or not. 

   While Charter schools have higher average math scores, the difference in average scores by grade between Charter 
   schools and Public schools is not that great. In fact, the biggest difference is in average math scores 
   is only 8.71 points different.

The number of students per school does vary greatly, ranging from 171 to 2,038.  

I recommend digging into the ratio of budget dollars per student and how that might correlate to both math and
reading score levels. This analysis could go as far as budget dollars per student per grade per school, compared
average math and/or reading scores per grade per school for each of the 15 schools in order to see if there correlation between math and/or
reading scores and the budget dollars per student.